# Project 1

In [13]:
import pandas as pd

## Extract data from CSV file

In [30]:
url="https://raw.githubusercontent.com/davidally/python-notebooks/master/First_Project.csv"
df = pd.read_csv(url)
# Drop empty row
fixed = df.dropna(how='all')
fixed

,Unnamed: 0,Unnamed: 1,Los Angeles,Phoenix,San Diego,San Francisco,Seattle
0,Alaska,On Time,497.0,221.0,212.0,503.0,1841.0
1,Alaska,Delayed,62.0,12.0,20.0,102.0,305.0
3,AM West,On Time,694.0,4840.0,383.0,320.0,201.0
4,AM West,Delayed,117.0,415.0,65.0,129.0,61.0

## Sum the delays

In [56]:
#Analyse the delayed times
extracted = fixed.iloc[[1, 3]]
extracted

,Unnamed: 0,Unnamed: 1,Los Angeles,Phoenix,San Diego,San Francisco,Seattle
1,Alaska,Delayed,62.0,12.0,20.0,102.0,305.0
4,AM West,Delayed,117.0,415.0,65.0,129.0,61.0

In [59]:
extracted.sum(axis=1)

1    501.0
4    787.0
dtype: float64

### Based on this comparison of sums, we can conclude AM West has a higher rate of delays than Alaska.

In [61]:
x = fixed.iloc[[0, 2]]
x

,Unnamed: 0,Unnamed: 1,Los Angeles,Phoenix,San Diego,San Francisco,Seattle
0,Alaska,On Time,497.0,221.0,212.0,503.0,1841.0
3,AM West,On Time,694.0,4840.0,383.0,320.0,201.0

In [62]:
x.sum(axis=1)

0    3274.0
3    6438.0
dtype: float64

### We can see from looking at the rate of On Time flights, AM West has a significantly better rate than Alaska. This means that AM West is the more efficient airline when you consider the small difference in delays, there is a much larger gap between on time flights.